# -*- coding: utf-8 -*-
"""
Unicode blocks "Arabic Presentation Forms-A" and "Arabic Presentation Forms-B"

Characters in the presentation forms are mapped to their base letters.
"""

# Word ligatures are often attached to the previou word. Add a space before
# word ligatures when normalizing, otherwise the converted string will combine
# to the previous word.
WORD_LIGATURES = [
    "﵀", #رحمه الله
    "﵁", #رضي الله عنه
    "﵂", #رضي الله عنها
    "﵃", #رضي الله عنهم
    "﵄", #رضي الله عنهما
    "﵅", #رضي الله عنهن
    "﵆", #صلى الله عليه وآله
    "﵇", #عليه السلام
    "﵈", #عليهم السلام
    "﵉", #عليهما السلام
    "﵊", #عليه الصلاة والسلام
    "﵋", #قدس سره
    "﵌", #صلى الله عليه وآله وسلم
    "﵍", #عليها السلام
    "﵎", #تبارك وتعالى
    "﵏", #رحمهم الله
    "﷏", #سلامه علينا
    "ﷰ", #صلے
    "ﷱ", #قلے
    "ﷲ", #الله
    "ﷳ", #اكبر
    "ﷴ", #محمد
    "ﷵ", #صلعم
    "ﷶ", #رسول
    "ﷷ", #عليه
    "ﷸ", #وسلم
    "ﷹ", #صلى
    "ﷺ", #صلى الله عليه وسلم
    "ﷻ", #جل جلاله
    "﷼", #ريال
    "﷽", #بسم الله الرحمن الرحيم
    "﷾", #سبحانه وتعالى
    "﷿", #عزوجل
]

PRESENTATION_FORMS = {
    "ﭐ": "ٱ",   # 0xfb50
    "ﭑ": "ٱ",   # 0xfb51
    "ﭒ": "ٻ",   # 0xfb52
    "ﭓ": "ٻ",   # 0xfb53
    "ﭔ": "ٻ",   # 0xfb54
    "ﭕ": "ٻ",   # 0xfb55
    "ﭖ": "پ",   # 0xfb56
    "ﭗ": "پ",   # 0xfb57
    "ﭘ": "پ",   # 0xfb58
    "ﭙ": "پ",   # 0xfb59
    "ﭚ": "ڀ",   # 0xfb5a
    "ﭛ": "ڀ",   # 0xfb5b
    "ﭜ": "ڀ",   # 0xfb5c
    "ﭝ": "ڀ",   # 0xfb5d
    "ﭞ": "ٺ",   # 0xfb5e
    "ﭟ": "ٺ",   # 0xfb5f
    "ﭠ": "ٺ",   # 0xfb60
    "ﭡ": "ٺ",   # 0xfb61
    "ﭢ": "ٿ",   # 0xfb62
    "ﭣ": "ٿ",   # 0xfb63
    "ﭤ": "ٿ",   # 0xfb64
    "ﭥ": "ٿ",   # 0xfb65
    "ﭦ": "ٹ",   # 0xfb66
    "ﭧ": "ٹ",   # 0xfb67
    "ﭨ": "ٹ",   # 0xfb68
    "ﭩ": "ٹ",   # 0xfb69
    "ﭪ": "ڤ",   # 0xfb6a
    "ﭫ": "ڤ",   # 0xfb6b
    "ﭬ": "ڤ",   # 0xfb6c
    "ﭭ": "ڤ",   # 0xfb6d
    "ﭮ": "ڦ",   # 0xfb6e
    "ﭯ": "ڦ",   # 0xfb6f
    "ﭰ": "ڦ",   # 0xfb70
    "ﭱ": "ڦ",   # 0xfb71
    "ﭲ": "ڄ",   # 0xfb72
    "ﭳ": "ڄ",   # 0xfb73
    "ﭴ": "ڄ",   # 0xfb74
    "ﭵ": "ڄ",   # 0xfb75
    "ﭶ": "ڃ",   # 0xfb76
    "ﭷ": "ڃ",   # 0xfb77
    "ﭸ": "ڃ",   # 0xfb78
    "ﭹ": "ڃ",   # 0xfb79
    "ﭺ": "چ",   # 0xfb7a
    "ﭻ": "چ",   # 0xfb7b
    "ﭼ": "چ",   # 0xfb7c
    "ﭽ": "چ",   # 0xfb7d
    "ﭾ": "ڇ",   # 0xfb7e
    "ﭿ": "ڇ",   # 0xfb7f
    "ﮀ": "ڇ",   # 0xfb80
    "ﮁ": "ڇ",   # 0xfb81
    "ﮂ": "ڍ",   # 0xfb82
    "ﮃ": "ڍ",   # 0xfb83
    "ﮄ": "ڌ",   # 0xfb84
    "ﮅ": "ڌ",   # 0xfb85
    "ﮆ": "ڎ",   # 0xfb86
    "ﮇ": "ڎ",   # 0xfb87
    "ﮈ": "ڈ",   # 0xfb88
    "ﮉ": "ڈ",   # 0xfb89
    "ﮊ": "ژ",   # 0xfb8a
    "ﮋ": "ژ",   # 0xfb8b
    "ﮌ": "ڑ",   # 0xfb8c
    "ﮍ": "ڑ",   # 0xfb8d
    "ﮎ": "ک",   # 0xfb8e
    "ﮏ": "ک",   # 0xfb8f
    "ﮐ": "ک",   # 0xfb90
    "ﮑ": "ک",   # 0xfb91
    "ﮒ": "گ",   # 0xfb92
    "ﮓ": "گ",   # 0xfb93
    "ﮔ": "گ",   # 0xfb94
    "ﮕ": "گ",   # 0xfb95
    "ﮖ": "ڳ",   # 0xfb96
    "ﮗ": "ڳ",   # 0xfb97
    "ﮘ": "ڳ",   # 0xfb98
    "ﮙ": "ڳ",   # 0xfb99
    "ﮚ": "ڱ",   # 0xfb9a
    "ﮛ": "ڱ",   # 0xfb9b
    "ﮜ": "ڱ",   # 0xfb9c
    "ﮝ": "ڱ",   # 0xfb9d
    "ﮞ": "ں",   # 0xfb9e
    "ﮟ": "ں",   # 0xfb9f
    "ﮠ": "ڻ",   # 0xfba0
    "ﮡ": "ڻ",   # 0xfba1
    "ﮢ": "ڻ",   # 0xfba2
    "ﮣ": "ڻ",   # 0xfba3
    "ﮤ": "ۀ",   # 0xfba4
    "ﮥ": "ۀ",   # 0xfba5
    "ﮦ": "ہ",   # 0xfba6
    "ﮧ": "ہ",   # 0xfba7
    "ﮨ": "ہ",   # 0xfba8
    "ﮩ": "ہ",   # 0xfba9
    "ﮪ": "ھ",   # 0xfbaa
    "ﮫ": "ھ",   # 0xfbab
    "ﮬ": "ھ",   # 0xfbac
    "ﮭ": "ھ",   # 0xfbad
    "ﮮ": "ے",   # 0xfbae
    "ﮯ": "ے",   # 0xfbaf
    "ﮰ": "ۓ",   # 0xfbb0
    "ﮱ": "ۓ",   # 0xfbb1
    "﮲": "",     # 0xfbb2
    "﮳": "",    # 0xfbb3
    "﮴": "",     # 0xfbb4
    "﮵": "",    # 0xfbb5
    "﮶": "",     # 0xfbb6
    "﮷": "",    # 0xfbb7
    "﮸": "",    # 0xfbb8
    "﮹": "",     # 0xfbb9
    "﮺": "",    # 0xfbba
    "﮻": "",    # 0xfbbb
    "﮼": "",    # 0xfbbc
    "﮽": "",    # 0xfbbd
    "﮾": "",    # 0xfbbe
    "﮿": "",    # 0xfbbf
    "﯀": "",    # 0xfbc0
    "﯁": "",    # 0xfbc1
    "﯂": "",    # 0xfbc2
    "ﯓ": "ڭ",   # 0xfbd3
    "ﯔ": "ڭ",   # 0xfbd4
    "ﯕ": "ڭ",   # 0xfbd5
    "ﯖ": "ڭ",   # 0xfbd6
    "ﯗ": "ۇ",   # 0xfbd7
    "ﯘ": "ۇ",   # 0xfbd8
    "ﯙ": "ۆ",   # 0xfbd9
    "ﯚ": "ۆ",   # 0xfbda
    "ﯛ": "ۈ",   # 0xfbdb
    "ﯜ": "ۈ",   # 0xfbdc
    "ﯝ": "ٷ",   # 0xfbdd
    "ﯞ": "ۋ",   # 0xfbde
    "ﯟ": "ۋ",   # 0xfbdf
    "ﯠ": "ۅ",   # 0xfbe0
    "ﯡ": "ۅ",   # 0xfbe1
    "ﯢ": "ۉ",   # 0xfbe2
    "ﯣ": "ۉ",   # 0xfbe3
    "ﯤ": "ې",   # 0xfbe4
    "ﯥ": "ې",   # 0xfbe5
    "ﯦ": "ې",   # 0xfbe6
    "ﯧ": "ې",   # 0xfbe7
    "ﯨ": "ى",   # 0xfbe8
    "ﯩ": "ى",   # 0xfbe9
    "ﯪ": "ئا",   # 0xfbea
    "ﯫ": "ئا",   # 0xfbeb
    "ﯬ": "ئە",   # 0xfbec
    "ﯭ": "ئە",   # 0xfbed
    "ﯮ": "ئو",   # 0xfbee
    "ﯯ": "ئو",   # 0xfbef
    "ﯰ": "ئۇ",   # 0xfbf0
    "ﯱ": "ئۇ",   # 0xfbf1
    "ﯲ": "ئۆ",   # 0xfbf2
    "ﯳ": "ئۆ",   # 0xfbf3
    "ﯴ": "ئۈ",   # 0xfbf4
    "ﯵ": "ئۈ",   # 0xfbf5
    "ﯶ": "ئې",   # 0xfbf6
    "ﯷ": "ئې",   # 0xfbf7
    "ﯸ": "ئې",   # 0xfbf8
    "ﯹ": "ئى",   # 0xfbf9
    "ﯺ": "ئى",   # 0xfbfa
    "ﯻ": "ئى",   # 0xfbfb
    "ﯼ": "ی",    # 0xfbfc
    "ﯽ": "ی",    # 0xfbfd
    "ﯾ": "ی",    # 0xfbfe
    "ﯿ": "ی",    # 0xfbff
    "ﰀ": "ئج",   # 0xfc00
    "ﰁ": "ئح",   # 0xfc01
    "ﰂ": "ئم",   # 0xfc02
    "ﰃ": "ئى",   # 0xfc03
    "ﰄ": "ئي",   # 0xfc04
    "ﰅ": "بج",   # 0xfc05
    "ﰆ": "بح",   # 0xfc06
    "ﰇ": "بخ",   # 0xfc07
    "ﰈ": "بم",   # 0xfc08
    "ﰉ": "بى",   # 0xfc09
    "ﰊ": "بي",   # 0xfc0a
    "ﰋ": "تج",   # 0xfc0b
    "ﰌ": "تح",   # 0xfc0c
    "ﰍ": "تخ",   # 0xfc0d
    "ﰎ": "تم",   # 0xfc0e
    "ﰏ": "تى",   # 0xfc0f
    "ﰐ": "تي",   # 0xfc10
    "ﰑ": "ثج",   # 0xfc11
    "ﰒ": "ثم",   # 0xfc12
    "ﰓ": "ثى",   # 0xfc13
    "ﰔ": "ثي",   # 0xfc14
    "ﰕ": "جح",   # 0xfc15
    "ﰖ": "جم",   # 0xfc16
    "ﰗ": "حج",   # 0xfc17
    "ﰘ": "حم",   # 0xfc18
    "ﰙ": "خج",   # 0xfc19
    "ﰚ": "خح",   # 0xfc1a
    "ﰛ": "خم",   # 0xfc1b
    "ﰜ": "سج",   # 0xfc1c
    "ﰝ": "سح",   # 0xfc1d
    "ﰞ": "سخ",   # 0xfc1e
    "ﰟ": "سم",   # 0xfc1f
    "ﰠ": "صح",   # 0xfc20
    "ﰡ": "صم",   # 0xfc21
    "ﰢ": "ضج",   # 0xfc22
    "ﰣ": "ضح",   # 0xfc23
    "ﰤ": "ضخ",   # 0xfc24
    "ﰥ": "ضم",   # 0xfc25
    "ﰦ": "طح",   # 0xfc26
    "ﰧ": "طم",   # 0xfc27
    "ﰨ": "ظم",   # 0xfc28
    "ﰩ": "عج",   # 0xfc29
    "ﰪ": "عم",   # 0xfc2a
    "ﰫ": "غج",   # 0xfc2b
    "ﰬ": "غم",   # 0xfc2c
    "ﰭ": "فج",   # 0xfc2d
    "ﰮ": "فح",   # 0xfc2e
    "ﰯ": "فخ",   # 0xfc2f
    "ﰰ": "فم",   # 0xfc30
    "ﰱ": "فى",   # 0xfc31
    "ﰲ": "في",   # 0xfc32
    "ﰳ": "قح",   # 0xfc33
    "ﰴ": "قم",   # 0xfc34
    "ﰵ": "قى",   # 0xfc35
    "ﰶ": "قي",   # 0xfc36
    "ﰷ": "كا",   # 0xfc37
    "ﰸ": "كج",   # 0xfc38
    "ﰹ": "كح",   # 0xfc39
    "ﰺ": "كخ",   # 0xfc3a
    "ﰻ": "كل",   # 0xfc3b
    "ﰼ": "كم",   # 0xfc3c
    "ﰽ": "كى",   # 0xfc3d
    "ﰾ": "كي",   # 0xfc3e
    "ﰿ": "لج",   # 0xfc3f
    "ﱀ": "لح",   # 0xfc40
    "ﱁ": "لخ",   # 0xfc41
    "ﱂ": "لم",   # 0xfc42
    "ﱃ": "لى",   # 0xfc43
    "ﱄ": "لي",   # 0xfc44
    "ﱅ": "مج",   # 0xfc45
    "ﱆ": "مح",   # 0xfc46
    "ﱇ": "مخ",   # 0xfc47
    "ﱈ": "مم",   # 0xfc48
    "ﱉ": "مى",   # 0xfc49
    "ﱊ": "مي",   # 0xfc4a
    "ﱋ": "نج",   # 0xfc4b
    "ﱌ": "نح",   # 0xfc4c
    "ﱍ": "نخ",   # 0xfc4d
    "ﱎ": "نم",   # 0xfc4e
    "ﱏ": "نى",   # 0xfc4f
    "ﱐ": "ني",   # 0xfc50
    "ﱑ": "هج",   # 0xfc51
    "ﱒ": "هم",   # 0xfc52
    "ﱓ": "هى",   # 0xfc53
    "ﱔ": "هي",   # 0xfc54
    "ﱕ": "يج",   # 0xfc55
    "ﱖ": "يح",   # 0xfc56
    "ﱗ": "يخ",   # 0xfc57
    "ﱘ": "يم",   # 0xfc58
    "ﱙ": "يى",   # 0xfc59
    "ﱚ": "يي",   # 0xfc5a
    "ﱛ": "ذٰ",    # 0xfc5b
    "ﱜ": "رٰ",    # 0xfc5c
    "ﱝ": "ىٰ",    # 0xfc5d
    "ﱞ": " ٌّ",     # 0xfc5e
    "ﱟ": " ٍّ",     # 0xfc5f
    "ﱠ": " َّ",     # 0xfc60
    "ﱡ": " ُّ",     # 0xfc61
    "ﱢ": " ِّ",     # 0xfc62
    "ﱣ": " ّٰ",     # 0xfc63
    "ﱤ": "ئر",   # 0xfc64
    "ﱥ": "ئز",   # 0xfc65
    "ﱦ": "ئم",   # 0xfc66
    "ﱧ": "ئن",   # 0xfc67
    "ﱨ": "ئى",   # 0xfc68
    "ﱩ": "ئي",   # 0xfc69
    "ﱪ": "بر",   # 0xfc6a
    "ﱫ": "بز",   # 0xfc6b
    "ﱬ": "بم",   # 0xfc6c
    "ﱭ": "بن",   # 0xfc6d
    "ﱮ": "بى",   # 0xfc6e
    "ﱯ": "بي",   # 0xfc6f
    "ﱰ": "تر",   # 0xfc70
    "ﱱ": "تز",   # 0xfc71
    "ﱲ": "تم",   # 0xfc72
    "ﱳ": "تن",   # 0xfc73
    "ﱴ": "تى",   # 0xfc74
    "ﱵ": "تي",   # 0xfc75
    "ﱶ": "ثر",   # 0xfc76
    "ﱷ": "ثز",   # 0xfc77
    "ﱸ": "ثم",   # 0xfc78
    "ﱹ": "ثن",   # 0xfc79
    "ﱺ": "ثى",   # 0xfc7a
    "ﱻ": "ثي",   # 0xfc7b
    "ﱼ": "فى",   # 0xfc7c
    "ﱽ": "في",   # 0xfc7d
    "ﱾ": "قى",   # 0xfc7e
    "ﱿ": "قي",   # 0xfc7f
    "ﲀ": "كا",   # 0xfc80
    "ﲁ": "كل",   # 0xfc81
    "ﲂ": "كم",   # 0xfc82
    "ﲃ": "كى",   # 0xfc83
    "ﲄ": "كي",   # 0xfc84
    "ﲅ": "لم",   # 0xfc85
    "ﲆ": "لى",   # 0xfc86
    "ﲇ": "لي",   # 0xfc87
    "ﲈ": "ما",   # 0xfc88
    "ﲉ": "مم",   # 0xfc89
    "ﲊ": "نر",   # 0xfc8a
    "ﲋ": "نز",   # 0xfc8b
    "ﲌ": "نم",   # 0xfc8c
    "ﲍ": "نن",   # 0xfc8d
    "ﲎ": "نى",   # 0xfc8e
    "ﲏ": "ني",   # 0xfc8f
    "ﲐ": "ىٰ",    # 0xfc90
    "ﲑ": "ير",   # 0xfc91
    "ﲒ": "يز",   # 0xfc92
    "ﲓ": "يم",   # 0xfc93
    "ﲔ": "ين",   # 0xfc94
    "ﲕ": "يى",   # 0xfc95
    "ﲖ": "يي",   # 0xfc96
    "ﲗ": "ئج",   # 0xfc97
    "ﲘ": "ئح",   # 0xfc98
    "ﲙ": "ئخ",   # 0xfc99
    "ﲚ": "ئم",   # 0xfc9a
    "ﲛ": "ئه",   # 0xfc9b
    "ﲜ": "بج",   # 0xfc9c
    "ﲝ": "بح",   # 0xfc9d
    "ﲞ": "بخ",   # 0xfc9e
    "ﲟ": "بم",   # 0xfc9f
    "ﲠ": "به",   # 0xfca0
    "ﲡ": "تج",   # 0xfca1
    "ﲢ": "تح",   # 0xfca2
    "ﲣ": "تخ",   # 0xfca3
    "ﲤ": "تم",   # 0xfca4
    "ﲥ": "ته",   # 0xfca5
    "ﲦ": "ثم",   # 0xfca6
    "ﲧ": "جح",   # 0xfca7
    "ﲨ": "جم",   # 0xfca8
    "ﲩ": "حج",   # 0xfca9
    "ﲪ": "حم",   # 0xfcaa
    "ﲫ": "خج",   # 0xfcab
    "ﲬ": "خم",   # 0xfcac
    "ﲭ": "سج",   # 0xfcad
    "ﲮ": "سح",   # 0xfcae
    "ﲯ": "سخ",   # 0xfcaf
    "ﲰ": "سم",   # 0xfcb0
    "ﲱ": "صح",   # 0xfcb1
    "ﲲ": "صخ",   # 0xfcb2
    "ﲳ": "صم",   # 0xfcb3
    "ﲴ": "ضج",   # 0xfcb4
    "ﲵ": "ضح",   # 0xfcb5
    "ﲶ": "ضخ",   # 0xfcb6
    "ﲷ": "ضم",   # 0xfcb7
    "ﲸ": "طح",   # 0xfcb8
    "ﲹ": "ظم",   # 0xfcb9
    "ﲺ": "عج",   # 0xfcba
    "ﲻ": "عم",   # 0xfcbb
    "ﲼ": "غج",   # 0xfcbc
    "ﲽ": "غم",   # 0xfcbd
    "ﲾ": "فج",   # 0xfcbe
    "ﲿ": "فح",   # 0xfcbf
    "ﳀ": "فخ",   # 0xfcc0
    "ﳁ": "فم",   # 0xfcc1
    "ﳂ": "قح",   # 0xfcc2
    "ﳃ": "قم",   # 0xfcc3
    "ﳄ": "كج",   # 0xfcc4
    "ﳅ": "كح",   # 0xfcc5
    "ﳆ": "كخ",   # 0xfcc6
    "ﳇ": "كل",   # 0xfcc7
    "ﳈ": "كم",   # 0xfcc8
    "ﳉ": "لج",   # 0xfcc9
    "ﳊ": "لح",   # 0xfcca
    "ﳋ": "لخ",   # 0xfccb
    "ﳌ": "لم",   # 0xfccc
    "ﳍ": "له",   # 0xfccd
    "ﳎ": "مج",   # 0xfcce
    "ﳏ": "مح",   # 0xfccf
    "ﳐ": "مخ",   # 0xfcd0
    "ﳑ": "مم",   # 0xfcd1
    "ﳒ": "نج",   # 0xfcd2
    "ﳓ": "نح",   # 0xfcd3
    "ﳔ": "نخ",   # 0xfcd4
    "ﳕ": "نم",   # 0xfcd5
    "ﳖ": "نه",   # 0xfcd6
    "ﳗ": "هج",   # 0xfcd7
    "ﳘ": "هم",   # 0xfcd8
    "ﳙ": "هٰ",    # 0xfcd9
    "ﳚ": "يج",   # 0xfcda
    "ﳛ": "يح",   # 0xfcdb
    "ﳜ": "يخ",   # 0xfcdc
    "ﳝ": "يم",   # 0xfcdd
    "ﳞ": "يه",   # 0xfcde
    "ﳟ": "ئم",   # 0xfcdf
    "ﳠ": "ئه",   # 0xfce0
    "ﳡ": "بم",   # 0xfce1
    "ﳢ": "به",   # 0xfce2
    "ﳣ": "تم",   # 0xfce3
    "ﳤ": "ته",   # 0xfce4
    "ﳥ": "ثم",   # 0xfce5
    "ﳦ": "ثه",   # 0xfce6
    "ﳧ": "سم",   # 0xfce7
    "ﳨ": "سه",   # 0xfce8
    "ﳩ": "شم",   # 0xfce9
    "ﳪ": "شه",   # 0xfcea
    "ﳫ": "كل",   # 0xfceb
    "ﳬ": "كم",   # 0xfcec
    "ﳭ": "لم",   # 0xfced
    "ﳮ": "نم",   # 0xfcee
    "ﳯ": "نه",   # 0xfcef
    "ﳰ": "يم",   # 0xfcf0
    "ﳱ": "يه",   # 0xfcf1
    "ﳲ": "ـَّ",    # 0xfcf2
    "ﳳ": "ـُّ",    # 0xfcf3
    "ﳴ": "ـِّ",    # 0xfcf4
    "ﳵ": "طى",   # 0xfcf5
    "ﳶ": "طي",   # 0xfcf6
    "ﳷ": "عى",   # 0xfcf7
    "ﳸ": "عي",   # 0xfcf8
    "ﳹ": "غى",   # 0xfcf9
    "ﳺ": "غي",   # 0xfcfa
    "ﳻ": "سى",   # 0xfcfb
    "ﳼ": "سي",   # 0xfcfc
    "ﳽ": "شى",   # 0xfcfd
    "ﳾ": "شي",   # 0xfcfe
    "ﳿ": "حى",   # 0xfcff
    "ﴀ": "حي",   # 0xfd00
    "ﴁ": "جى",   # 0xfd01
    "ﴂ": "جي",   # 0xfd02
    "ﴃ": "خى",   # 0xfd03
    "ﴄ": "خي",   # 0xfd04
    "ﴅ": "صى",   # 0xfd05
    "ﴆ": "صي",   # 0xfd06
    "ﴇ": "ضى",   # 0xfd07
    "ﴈ": "ضي",   # 0xfd08
    "ﴉ": "شج",   # 0xfd09
    "ﴊ": "شح",   # 0xfd0a
    "ﴋ": "شخ",   # 0xfd0b
    "ﴌ": "شم",   # 0xfd0c
    "ﴍ": "شر",   # 0xfd0d
    "ﴎ": "سر",   # 0xfd0e
    "ﴏ": "صر",   # 0xfd0f
    "ﴐ": "ضر",   # 0xfd10
    "ﴑ": "طى",   # 0xfd11
    "ﴒ": "طي",   # 0xfd12
    "ﴓ": "عى",   # 0xfd13
    "ﴔ": "عي",   # 0xfd14
    "ﴕ": "غى",   # 0xfd15
    "ﴖ": "غي",   # 0xfd16
    "ﴗ": "سى",   # 0xfd17
    "ﴘ": "سي",   # 0xfd18
    "ﴙ": "شى",   # 0xfd19
    "ﴚ": "شي",   # 0xfd1a
    "ﴛ": "حى",   # 0xfd1b
    "ﴜ": "حي",   # 0xfd1c
    "ﴝ": "جى",   # 0xfd1d
    "ﴞ": "جي",   # 0xfd1e
    "ﴟ": "خى",   # 0xfd1f
    "ﴠ": "خي",   # 0xfd20
    "ﴡ": "صى",   # 0xfd21
    "ﴢ": "صي",   # 0xfd22
    "ﴣ": "ضى",   # 0xfd23
    "ﴤ": "ضي",   # 0xfd24
    "ﴥ": "شج",   # 0xfd25
    "ﴦ": "شح",   # 0xfd26
    "ﴧ": "شخ",   # 0xfd27
    "ﴨ": "شم",   # 0xfd28
    "ﴩ": "شر",   # 0xfd29
    "ﴪ": "سر",   # 0xfd2a
    "ﴫ": "صر",   # 0xfd2b
    "ﴬ": "ضر",   # 0xfd2c
    "ﴭ": "شج",   # 0xfd2d
    "ﴮ": "شح",   # 0xfd2e
    "ﴯ": "شخ",   # 0xfd2f
    "ﴰ": "شم",   # 0xfd30
    "ﴱ": "سه",   # 0xfd31
    "ﴲ": "شه",   # 0xfd32
    "ﴳ": "طم",   # 0xfd33
    "ﴴ": "سج",   # 0xfd34
    "ﴵ": "سح",   # 0xfd35
    "ﴶ": "سخ",   # 0xfd36
    "ﴷ": "شج",   # 0xfd37
    "ﴸ": "شح",   # 0xfd38
    "ﴹ": "شخ",   # 0xfd39
    "ﴺ": "طم",   # 0xfd3a
    "ﴻ": "ظم",   # 0xfd3b
    "ﴼ": "اً",    # 0xfd3c
    "ﴽ": "اً",    # 0xfd3d
    "﴾": "(",    # 0xfd3e
    "﴿": ")",    # 0xfd3f
    "﵀": "رحمه الله",   # 0xfd40
    "﵁": "رضي الله عنه",   # 0xfd41
    "﵂": "رضي الله عنها",   # 0xfd42
    "﵃": "رضي الله عنهم",   # 0xfd43
    "﵄": "رضي الله عنهما",   # 0xfd44
    "﵅": "رضي الله عنهن",   # 0xfd45
    "﵆": "صلى الله عليه وآله",   # 0xfd46
    "﵇": "عليه السلام",   # 0xfd47
    "﵈": "عليهم السلام",   # 0xfd48
    "﵉": "عليهما السلام",   # 0xfd49
    "﵊": "عليه الصلاة والسلام",   # 0xfd4a
    "﵋": "قدس سره",   # 0xfd4b
    "﵌": "صلى الله عليه وآله وسلم",   # 0xfd4c
    "﵍": "عليها السلام",   # 0xfd4d
    "﵎": "تبارك وتعالى",   # 0xfd4e
    "﵏": "رحمهم الله",   # 0xfd4f
    "ﵐ": "تجم",   # 0xfd50
    "ﵑ": "تحج",   # 0xfd51
    "ﵒ": "تحج",   # 0xfd52
    "ﵓ": "تحم",   # 0xfd53
    "ﵔ": "تخم",   # 0xfd54
    "ﵕ": "تمج",   # 0xfd55
    "ﵖ": "تمح",   # 0xfd56
    "ﵗ": "تمخ",   # 0xfd57
    "ﵘ": "جمح",   # 0xfd58
    "ﵙ": "جمح",   # 0xfd59
    "ﵚ": "حمي",   # 0xfd5a
    "ﵛ": "حمى",   # 0xfd5b
    "ﵜ": "سحج",   # 0xfd5c
    "ﵝ": "سجح",   # 0xfd5d
    "ﵞ": "سجى",   # 0xfd5e
    "ﵟ": "سمح",   # 0xfd5f
    "ﵠ": "سمح",   # 0xfd60
    "ﵡ": "سمج",   # 0xfd61
    "ﵢ": "سمم",   # 0xfd62
    "ﵣ": "سمم",   # 0xfd63
    "ﵤ": "صحح",   # 0xfd64
    "ﵥ": "صحح",   # 0xfd65
    "ﵦ": "صمم",   # 0xfd66
    "ﵧ": "شحم",   # 0xfd67
    "ﵨ": "شحم",   # 0xfd68
    "ﵩ": "شجي",   # 0xfd69
    "ﵪ": "شمخ",   # 0xfd6a
    "ﵫ": "شمخ",   # 0xfd6b
    "ﵬ": "شمم",   # 0xfd6c
    "ﵭ": "شمم",   # 0xfd6d
    "ﵮ": "ضحى",   # 0xfd6e
    "ﵯ": "ضخم",   # 0xfd6f
    "ﵰ": "ضخم",   # 0xfd70
    "ﵱ": "طمح",   # 0xfd71
    "ﵲ": "طمح",   # 0xfd72
    "ﵳ": "طمم",   # 0xfd73
    "ﵴ": "طمي",   # 0xfd74
    "ﵵ": "عجم",   # 0xfd75
    "ﵶ": "عمم",   # 0xfd76
    "ﵷ": "عمم",   # 0xfd77
    "ﵸ": "عمى",   # 0xfd78
    "ﵹ": "غمم",   # 0xfd79
    "ﵺ": "غمي",   # 0xfd7a
    "ﵻ": "غمى",   # 0xfd7b
    "ﵼ": "فخم",   # 0xfd7c
    "ﵽ": "فخم",   # 0xfd7d
    "ﵾ": "قمح",   # 0xfd7e
    "ﵿ": "قمم",   # 0xfd7f
    "ﶀ": "لحم",   # 0xfd80
    "ﶁ": "لحي",   # 0xfd81
    "ﶂ": "لحى",   # 0xfd82
    "ﶃ": "لجج",   # 0xfd83
    "ﶄ": "لجج",   # 0xfd84
    "ﶅ": "لخم",   # 0xfd85
    "ﶆ": "لخم",   # 0xfd86
    "ﶇ": "لمح",   # 0xfd87
    "ﶈ": "لمح",   # 0xfd88
    "ﶉ": "محج",   # 0xfd89
    "ﶊ": "محم",   # 0xfd8a
    "ﶋ": "محي",   # 0xfd8b
    "ﶌ": "مجح",   # 0xfd8c
    "ﶍ": "مجم",   # 0xfd8d
    "ﶎ": "مخج",   # 0xfd8e
    "ﶏ": "مخم",   # 0xfd8f
    "ﶒ": "مجخ",   # 0xfd92
    "ﶓ": "همج",   # 0xfd93
    "ﶔ": "همم",   # 0xfd94
    "ﶕ": "نحم",   # 0xfd95
    "ﶖ": "نحى",   # 0xfd96
    "ﶗ": "نجم",   # 0xfd97
    "ﶘ": "نجم",   # 0xfd98
    "ﶙ": "نجى",   # 0xfd99
    "ﶚ": "نمي",   # 0xfd9a
    "ﶛ": "نمى",   # 0xfd9b
    "ﶜ": "يمم",   # 0xfd9c
    "ﶝ": "يمم",   # 0xfd9d
    "ﶞ": "بخي",   # 0xfd9e
    "ﶟ": "تجي",   # 0xfd9f
    "ﶠ": "تجى",   # 0xfda0
    "ﶡ": "تخي",   # 0xfda1
    "ﶢ": "تخى",   # 0xfda2
    "ﶣ": "تمي",   # 0xfda3
    "ﶤ": "تمى",   # 0xfda4
    "ﶥ": "جمي",   # 0xfda5
    "ﶦ": "جحى",   # 0xfda6
    "ﶧ": "جمى",   # 0xfda7
    "ﶨ": "سخى",   # 0xfda8
    "ﶩ": "صحي",   # 0xfda9
    "ﶪ": "شحي",   # 0xfdaa
    "ﶫ": "ضحي",   # 0xfdab
    "ﶬ": "لجي",   # 0xfdac
    "ﶭ": "لمي",   # 0xfdad
    "ﶮ": "يحي",   # 0xfdae
    "ﶯ": "يجي",   # 0xfdaf
    "ﶰ": "يمي",   # 0xfdb0
    "ﶱ": "ممي",   # 0xfdb1
    "ﶲ": "قمي",   # 0xfdb2
    "ﶳ": "نحي",   # 0xfdb3
    "ﶴ": "قمح",   # 0xfdb4
    "ﶵ": "لحم",   # 0xfdb5
    "ﶶ": "عمي",   # 0xfdb6
    "ﶷ": "كمي",   # 0xfdb7
    "ﶸ": "نجح",   # 0xfdb8
    "ﶹ": "مخي",   # 0xfdb9
    "ﶺ": "لجم",   # 0xfdba
    "ﶻ": "كمم",   # 0xfdbb
    "ﶼ": "لجم",   # 0xfdbc
    "ﶽ": "نجح",   # 0xfdbd
    "ﶾ": "جحي",   # 0xfdbe
    "ﶿ": "حجي",   # 0xfdbf
    "ﷀ": "مجي",   # 0xfdc0
    "ﷁ": "فمي",   # 0xfdc1
    "ﷂ": "بحي",   # 0xfdc2
    "ﷃ": "كمم",   # 0xfdc3
    "ﷄ": "عجم",   # 0xfdc4
    "ﷅ": "صمم",   # 0xfdc5
    "ﷆ": "سخي",   # 0xfdc6
    "ﷇ": "نجي",   # 0xfdc7
    "﷏": "سلامه علينا",   # 0xfdcf
    "ﷰ": "صلے",   # 0xfdf0
    "ﷱ": "قلے",   # 0xfdf1
    "ﷲ": "الله",  # 0xfdf2
    "ﷳ": "اكبر",  # 0xfdf3
    "ﷴ": "محمد",  # 0xfdf4
    "ﷵ": "صلعم",  # 0xfdf5
    "ﷶ": "رسول",  # 0xfdf6
    "ﷷ": "عليه",  # 0xfdf7
    "ﷸ": "وسلم",  # 0xfdf8
    "ﷹ": "صلى",   # 0xfdf9
    "ﷺ": "صلى الله عليه وسلم",   # 0xfdfa
    "ﷻ": "جل جلاله",   # 0xfdfb
    "﷼": "ريال",  # 0xfdfc
    "﷽": "بسم الله الرحمن الرحيم",   # 0xfdfd
    "﷾": "سبحانه وتعالى",   # 0xfdfe
    "﷿": "عزوجل", # 0xfdff
    "ﹰ": " ً",   # 0xfe70
    "ﹱ": "ـً",   # 0xfe71
    "ﹲ": " ٌ",   # 0xfe72
    "ﹳ": "",    # 0xfe73
    "ﹴ": " ٍ",   # 0xfe74
    "ﹶ": " َ",   # 0xfe76
    "ﹷ": "ـَ",   # 0xfe77
    "ﹸ": " ُ",   # 0xfe78
    "ﹹ": "ـُ",   # 0xfe79
    "ﹺ": " ِ",   # 0xfe7a
    "ﹻ": "ـِ",   # 0xfe7b
    "ﹼ": " ّ",   # 0xfe7c
    "ﹽ": "ـّ",   # 0xfe7d
    "ﹾ": " ْ",   # 0xfe7e
    "ﹿ": "ـْ",   # 0xfe7f
    "ﺀ": "ء",   # 0xfe80
    "ﺁ": "آ",   # 0xfe81
    "ﺂ": "آ",   # 0xfe82
    "ﺃ": "أ",   # 0xfe83
    "ﺄ": "أ",   # 0xfe84
    "ﺅ": "ؤ",   # 0xfe85
    "ﺆ": "ؤ",   # 0xfe86
    "ﺇ": "إ",   # 0xfe87
    "ﺈ": "إ",   # 0xfe88
    "ﺉ": "ئ",   # 0xfe89
    "ﺊ": "ئ",   # 0xfe8a
    "ﺋ": "ئ",   # 0xfe8b
    "ﺌ": "ئ",   # 0xfe8c
    "ﺍ": "ا",   # 0xfe8d
    "ﺎ": "ا",   # 0xfe8e
    "ﺏ": "ب",   # 0xfe8f
    "ﺐ": "ب",   # 0xfe90
    "ﺑ": "ب",   # 0xfe91
    "ﺒ": "ب",   # 0xfe92
    "ﺓ": "ة",   # 0xfe93
    "ﺔ": "ة",   # 0xfe94
    "ﺕ": "ت",   # 0xfe95
    "ﺖ": "ت",   # 0xfe96
    "ﺗ": "ت",   # 0xfe97
    "ﺘ": "ت",   # 0xfe98
    "ﺙ": "ث",   # 0xfe99
    "ﺚ": "ث",   # 0xfe9a
    "ﺛ": "ث",   # 0xfe9b
    "ﺜ": "ث",   # 0xfe9c
    "ﺝ": "ج",   # 0xfe9d
    "ﺞ": "ج",   # 0xfe9e
    "ﺟ": "ج",   # 0xfe9f
    "ﺠ": "ج",   # 0xfea0
    "ﺡ": "ح",   # 0xfea1
    "ﺢ": "ح",   # 0xfea2
    "ﺣ": "ح",   # 0xfea3
    "ﺤ": "ح",   # 0xfea4
    "ﺥ": "خ",   # 0xfea5
    "ﺦ": "خ",   # 0xfea6
    "ﺧ": "خ",   # 0xfea7
    "ﺨ": "خ",   # 0xfea8
    "ﺩ": "د",   # 0xfea9
    "ﺪ": "د",   # 0xfeaa
    "ﺫ": "ذ",   # 0xfeab
    "ﺬ": "ذ",   # 0xfeac
    "ﺭ": "ر",   # 0xfead
    "ﺮ": "ر",   # 0xfeae
    "ﺯ": "ز",   # 0xfeaf
    "ﺰ": "ز",   # 0xfeb0
    "ﺱ": "س",   # 0xfeb1
    "ﺲ": "س",   # 0xfeb2
    "ﺳ": "س",   # 0xfeb3
    "ﺴ": "س",   # 0xfeb4
    "ﺵ": "ش",   # 0xfeb5
    "ﺶ": "ش",   # 0xfeb6
    "ﺷ": "ش",   # 0xfeb7
    "ﺸ": "ش",   # 0xfeb8
    "ﺹ": "ص",   # 0xfeb9
    "ﺺ": "ص",   # 0xfeba
    "ﺻ": "ص",   # 0xfebb
    "ﺼ": "ص",   # 0xfebc
    "ﺽ": "ض",   # 0xfebd
    "ﺾ": "ض",   # 0xfebe
    "ﺿ": "ض",   # 0xfebf
    "ﻀ": "ض",   # 0xfec0
    "ﻁ": "ط",   # 0xfec1
    "ﻂ": "ط",   # 0xfec2
    "ﻃ": "ط",   # 0xfec3
    "ﻄ": "ط",   # 0xfec4
    "ﻅ": "ظ",   # 0xfec5
    "ﻆ": "ظ",   # 0xfec6
    "ﻇ": "ظ",   # 0xfec7
    "ﻈ": "ظ",   # 0xfec8
    "ﻉ": "ع",   # 0xfec9
    "ﻊ": "ع",   # 0xfeca
    "ﻋ": "ع",   # 0xfecb
    "ﻌ": "ع",   # 0xfecc
    "ﻍ": "غ",   # 0xfecd
    "ﻎ": "غ",   # 0xfece
    "ﻏ": "غ",   # 0xfecf
    "ﻐ": "غ",   # 0xfed0
    "ﻑ": "ف",   # 0xfed1
    "ﻒ": "ف",   # 0xfed2
    "ﻓ": "ف",   # 0xfed3
    "ﻔ": "ف",   # 0xfed4
    "ﻕ": "ق",   # 0xfed5
    "ﻖ": "ق",   # 0xfed6
    "ﻗ": "ق",   # 0xfed7
    "ﻘ": "ق",   # 0xfed8
    "ﻙ": "ك",   # 0xfed9
    "ﻚ": "ك",   # 0xfeda
    "ﻛ": "ك",   # 0xfedb
    "ﻜ": "ك",   # 0xfedc
    "ﻝ": "ل",   # 0xfedd
    "ﻞ": "ل",   # 0xfede
    "ﻟ": "ل",   # 0xfedf
    "ﻠ": "ل",   # 0xfee0
    "ﻡ": "م",   # 0xfee1
    "ﻢ": "م",   # 0xfee2
    "ﻣ": "م",   # 0xfee3
    "ﻤ": "م",   # 0xfee4
    "ﻥ": "ن",   # 0xfee5
    "ﻦ": "ن",   # 0xfee6
    "ﻧ": "ن",   # 0xfee7
    "ﻨ": "ن",   # 0xfee8
    "ﻩ": "ه",   # 0xfee9
    "ﻪ": "ه",   # 0xfeea
    "ﻫ": "ه",   # 0xfeeb
    "ﻬ": "ه",   # 0xfeec
    "ﻭ": "و",   # 0xfeed
    "ﻮ": "و",   # 0xfeee
    "ﻯ": "ى",   # 0xfeef
    "ﻰ": "ى",   # 0xfef0
    "ﻱ": "ي",   # 0xfef1
    "ﻲ": "ي",   # 0xfef2
    "ﻳ": "ي",   # 0xfef3
    "ﻴ": "ي",   # 0xfef4
    "ﻵ": "لآ",   # 0xfef5
    "ﻶ": "لآ",   # 0xfef6
    "ﻷ": "لأ",   # 0xfef7
    "ﻸ": "لأ",   # 0xfef8
    "ﻹ": "لإ",   # 0xfef9
    "ﻺ": "لإ",   # 0xfefa
    "ﻻ": "لا",   # 0xfefb
    "ﻼ": "لا",   # 0xfefc
    "\uFEFF": "\u200B",  # 0xfeff
}

def normalize_presentation_forms(string: str) -> str:
    """Convert characters from presentation forms into their standard letter equivalents."""

    indexed_chars = list(zip(list(range(len(string))), [x for x in string]))

    spaces_before_ligatures = [
        ' ' + x if x in WORD_LIGATURES and i > 0 and not indexed_chars[i-1][1].isspace() else x
        for i, x in indexed_chars
    ]

    str_list = [(PRESENTATION_FORMS.get(x) or x)
                   for x in ''.join(spaces_before_ligatures)]
    return ''.join(str_list)
